In [8]:
import pandas as pd
df1=pd.DataFrame({'A':[10],
                  'B':[20],
                  'C':[30]
                 
                 
                 })
df1

    A   B   C
0  10  20  30

In [11]:
df2=pd.DataFrame({'D':[40,12],
                  'E':[50,22],
                  'C':[60,33]
                 
                 })
df2

    D   E   C
0  40  50  60
1  12  22  33

In [12]:
n_df=pd.concat([df1,df2])
n_df

      A     B   C     D     E
0  10.0  20.0  30   NaN   NaN
0   NaN   NaN  60  40.0  50.0
1   NaN   NaN  33  12.0  22.0

In [13]:
bangladesh_weather=pd.DataFrame({
    'city':['Dhaka','Rajshahi','Rangpur'],
    'temperature':[10,20,30]
})
bangladesh_weather

       city  temperature
0     Dhaka           25
1  Rajshahi           29
2   Rangpur           33

In [16]:
Rangpur_weather=pd.DataFrame({
    'city':['Gaibandha','Lalmonihat','Kurigram'],
    'temperature':[40,50,50]
})
Rangpur_weather

         city  temperature
0   Gaibandha           40
1  Lalmonihat           50
2    Kurigram           50

In [22]:
n_df=pd.concat([bangladesh_weather,Rangpur_weather])
n_df

         city  temperature
0       Dhaka           25
1    Rajshahi           29
2     Rangpur           33
0   Gaibandha           40
1  Lalmonihat           50
2    Kurigram           50

In [23]:
n_df=pd.concat([bangladesh_weather,Rangpur_weather],ignore_index=True)
n_df

         city  temperature
0       Dhaka           25
1    Rajshahi           29
2     Rangpur           33
3   Gaibandha           40
4  Lalmonihat           50
5    Kurigram           50

In [24]:
n_df=pd.concat([bangladesh_weather,Rangpur_weather],keys=['bangladesh_weather','Rangpur_weather'])
n_df

                            city  temperature
bangladesh_weather 0       Dhaka           25
                   1    Rajshahi           29
                   2     Rangpur           33
Rangpur_weather    0   Gaibandha           40
                   1  Lalmonihat           50
                   2    Kurigram           50

In [27]:
n_df=pd.concat([bangladesh_weather,Rangpur_weather],
               keys=['bangladesh_weather','Rangpur_weather'],names=['Division names','serial no'])
n_df

                                    city  temperature
Division names     serial no
bangladesh_weather 0               Dhaka           25
                   1            Rajshahi           29
                   2             Rangpur           33
Rangpur_weather    0           Gaibandha           40
                   1          Lalmonihat           50
                   2            Kurigram           50

In [28]:
n_df.loc['Rangpur_weather']

                 city  temperature
serial no
0           Gaibandha           40
1          Lalmonihat           50
2            Kurigram           50

In [30]:
temp=pd.DataFrame({
    'city':['dhk','khl','ctga'],
    'temperature':[30,31,32]
})
temp

   city  temperature
0   dhk           30
1   khl           31
2  ctga           32

In [31]:
wind=pd.DataFrame({
    'city':['dhk','khl','ctga'],
    'windspeed':[5,9,6]
})
wind

   city  windspeed
0   dhk          5
1   khl          9
2  ctga          6

In [33]:
temp=pd.DataFrame({
    'city':['dhk','khl','ctga'],
    'temperature':[31,35,36]
},index=[1,2,3])
temp

   city  temperature
1   dhk           31
2   khl           35
3  ctga           36

In [34]:
wind=pd.DataFrame({
    'city':['khl','dhk','ctga'],
    'windspeed':[5,9,6]
},index=[2,1,3])
wind

   city  windspeed
2   khl          5
1   dhk          9
3  ctga          6

In [39]:
nw_df=pd.concat([temp,wind],axis=1)
nw_df

   city  temperature  city  windspeed
1   dhk           31   dhk          9
2   khl           35   khl          5
3  ctga           36  ctga          6

In [40]:
n=pd.Series(['rain','snow','sunny'],name='event')
n

0     rain
1     snow
2    sunny
Name: event, dtype: object